* Calculator

This calculator is written in flex/bison and follows the very nice
explanation on the Reverse Polish Notation Calculator of the [[http://dinosaur.compilertools.net/bison/bison_5.html#SEC16][Bison
Documentation]].

1. To compile it, just type =make=.
2. Run the program with =./calc=.

Here's an example of non-iteractive utilization

#+begin_src shell :results output
echo "2*3+4/(3+9)" | ./calc
#+end_src

#+RESULTS:
: Result: 6.333333
